// pages/home/home.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    categoryList: {
      pageone: [{
        name: "导购员",
        src: "/pages/images/1.png"
      }, {
        name: "实习生",
        src: "/pages/images/2.png"
      }, {
        name: "销售经理",
        src: "/pages/images/3.png"
      }, {
        name: "行政管理",
        src: "/pages/images/4.png"
      }, {
        name: "设计",
        src: "/pages/images/5.png"
      }, {
        name: "公关/媒介",
        src: "/pages/images/6.png"
      }, {
        name: "生产制造",
        src: "/pages/images/7.png"
      }, {
        name: "新商家",
        src: "/pages/images/8.png"
      }],
      pagetwo: [{
        name: "金融/银行",
        src: "/pages/images/1.png"
      }, {
        name: "广告/策划",
        src: "/pages/images/2.png"
      }, {
        name: "建筑/房产",
        src: "/pages/images/3.png"
      }, {
        name: "财务/审计",
        src: "/pages/images/4.png"
      }, {
        name: "汽车修理",
        src: "/pages/images/5.png"
      }, {
        name: "校招职位",
        src: "/pages/images/6.png"
      }, {
        name: "美容师",
        src: "/pages/images/7.png"
      }, {
        name: "厨师",
        src: "/pages/images/8.png"
      }]
    },
    "restaurant": [
      {
        "name": "签约艺人",
        "star": 5,
        "src": "/pages/images/jobs/签约艺人.jpg",
        "introduction1": "推荐奖",
        "introduction2": "高提成",
        "distance": "1.5km",
        "salary1": "8k",
        "salary2": "10k",
        "content1": "女：身高158以上，三围均匀，五官端正颜值高",
        "content2": "男：身高170以上，体态端庄，有个人魅力即可",
        "content3": "16-30岁喜欢拍照优先录用，详情在线咨询",
        "comment1": "老板对新人很好很贴心，教练也很耐心",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "祥龙文化传媒是一支从事舞美设计，舞台特效以及舞美专业设备制作租赁，歌手、主播、模特等演员输出的专业队伍。主要承接省内大，中，小型的文化演出，会议展会，演艺名人及演员经纪，企业庆典，公关策划，企业文化设计宣传新产品市场推广，各种发布会等等综合性质的全方位的，高水平的各类的宣传推广活动。 业务范围： 1、演出设备：出租专业舞台、灯光、音响、LED；背景架、TRUSS架；投影仪;钢化玻璃舞台； 2、舞美制作：舞台特效、灯光特效； 3、庆典、礼仪：拱门、气球、舞龙舞狮队、皇家礼炮、地毯等； 4、活动策划：文艺晚会、演唱会，婚礼、酒会，各类会展、车展； 5、演艺人员：主播、礼仪、模特、歌手、魔术、杂技等等。 本公司承接全省的各种演出，价格公道舞台效果震撼",
        "time": 30
      },
      {
        "name": "网拍模特",
        "star": 4,
        "src": "/pages/images/jobs/网拍模特1.jpg",
        "introduction1": "学历不限",
        "introduction2": "经验不限",
        "distance": "3.3km",
        "salary1": "6k",
        "salary2": "12k",
        "content1": "网拍模特复古旗袍唐装汉服",
        "content2": "旗袍礼服婚纱网拍 ",
        "content3": "要求：形象气质佳，身材比例匀称，喜欢展示自己，可空闲时间做！",
        "comment1": "摄影师很耐心，服装质量也不错，旗袍很好看。",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "影视文化艺术交流活动的组织、策划；广告的设计、制作、代理、发布；计算机软硬件的设计、开发；网络工程、智能化弱电系统、数字传媒领域内的技术开发、技术转让、技术咨询、技术服务；动漫产品设计、道具设计、包装设计、模型设计与制作；报刊、杂志、小说、机电设备、计算机软硬件及辅助设备、玩具、工艺美术品、文化办公用品、幼教用品、日用百货的销售及网上销售；知识产权代理、电信业务代理。（依法须经批准的项目，经相关部门批准后方可开展经营活动）",
        "time": 56
      },
      {
        "name": "摄影助理",
        "src": "/pages/images/jobs/摄影助理.jpg",
        "star": 0,
        "distance": "3.1km",
        "introduction1": "带薪年假",
        "introduction2": "免费培训",
        "salary1": "2k",
        "salary2": "3k",
        "content1": "1、18-30岁，有经验者优先、摄影专业优先；",
        "content2": "2、性格开朗，为人细致有耐心、善于与人合作；",
        "content3": "3、良好的语言表达及较强的沟通能力；",
        "comment1": "摄影师态度很好，就是有点严格，还是能学到点东西。",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "蒙娜丽莎-- - 您的结婚梦想家 1995年成立,西安首家外资专业婚纱影楼[中国十大杰出影楼] [中国商业信用企业],营业面积第一、亚洲规模最大的婚纱摄影机构,口碑最佳的婚纱影楼,全国首创主题式新娘造型,独家打造超豪华五星级“环球影城” 实景拍摄基地,独家推出奥塞画意摄影,首家推出美国休闲创意外拍,独家首创电影剧情式主题摄影风格,拥有第一家专属摄影基地-皇家会所,巨资打造2000平米国内顶级实景恒温片场“欧式新派摄影宫殿”。秉承“亲切、专业、创意、领先的经营理念服务于广大顾客。独特的影像风格，过硬的摄影技术，良好的口碑，使“蒙娜丽莎品牌”在婚纱摄影行业一直遥遥领先。",
        "time": 44
      },
      {
        "name": "迎宾",
        "star": 0,
        "sales": 24,
        "src": "/pages/images/jobs/迎宾.jpg",
        "introduction1": "年底双薪",
        "introduction2": "港澳新马泰游",
        "distance": "2.6km",
        "salary1": "12k",
        "salary2": "20k",
        "content1": "1、负责日常收支的管理和核对；",
        "content2": "2、负责收集和审核原始凭证，保证报销手续及原始单据的合法性、准确性；",
        "content3": "3、熟悉操作财务软件、Excel、Word等办公软件；",
        "comment1": "实际条件与岗位描述非常符合，工作环境和待遇也很不错",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "  西安树锦国医馆成立于1997年，由国家第二三四五批名老中医药专家师承导师姚树锦教授创办。其与一百五十多年前的太和医室一脉相承，近年来又被遴选为西安市非物质文化遗产，陕西省非物质文化遗产，医馆以医(疑难大病病诊治)、教(国家名老中医继承人陪养)、研(已有六项科研成果问世)为主旨与己任，服务于三秦大地。",
        "time": 44
      },
      {
        "name": "洗浴服务员",
        "src": "/pages/images/jobs/洗浴服务员.jpg",
        "star": 4.5,
        "introduction1": "包吃包住",
        "introduction2": "加班补助",
        "distance": "2.1km",
        "salary1": "3k",
        "salary2": "5k",
        "content1": "1、25-35岁，初中以上学历，身高160CM以上；",
        "content2": "2、仪容仪表大方，着装整洁，准时参加公司各项例会；",
        "content3": "3、有前台接待或客服方面的工作经验更好。懂粤语者优先。",
        "comment1": "工作环境比想象中要好，但是工作强度比较大，很累。",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "西安品靓娱乐有限公司目前服务于影视/媒体/艺术/文化/出版行业领域。具有专业的资深经历和雄厚实力，且于影视/媒体/艺术/文化/出版专业领域更深具见解。公司运作模式成熟流畅，利用强大的本地化操作能力和行销资源，与用户及企业打下了坚实的合作基础。 西安品靓娱乐有限公司通过长时间的经验积累，市场分析，完善服务等，得到了用户以及企业的首肯。在此真挚地希望发挥自有优势，为用户以及企业之间搭建一个坚实长久的合作平台。品靓团队是一个高端，时尚，个性的演艺团队！负责空降全国各地高端娱乐场所，时尚美丽自信的你就算没有经验，我们一样打造出属于你的时尚个性潮流",
        "time": 33
      },
      {
        "name": "医疗大数据研究员",
        "star": 4.5,
        "src": "/pages/images/jobs/医疗大数据研究员.jpg",
        "introduction1": "民营公司",
        "introduction2": "互联网/电子商务",
        "distance": "4.1km",
        "salary1": "13k",
        "salary2": "20k",
        "content1": "全日制硕士以上学历，有自然语言处理相关研发经验；",
        "content2": "熟悉机器学习的基本算法与概念，有Tensorflow、Caffe等深度学习库使用经验者优先；",
        "content3": "能够阅读英文技术文档和论文，具有良好的自学能力",
        "comment1": "工作强度比较大，加班没有计划，经常搞突然袭击，而且不关心员工，对员工非常冷淡，没有任何加班补助",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "腾讯公司于1998年11月在深圳成立，是中国最早也是目前中国市场上最大的互联网即时通信软件开发商。1999年2月，腾讯正式推出第一个即时通信软件---“腾讯QQ”；并于2004年6月16日在香港联交所主板上市（股票代号700）。成立7年多以来，腾讯一直以追求卓越的技术为导向，始终处于稳健、高速发展的状态。QQ超过5.490亿（截止到2006年6月30日）注册帐户的庞大受众群体现了腾讯对强负载大流量网络应用和各类即时通信应用的技术实力。",
        "time": 52
      },
      {
        "name": "软件测试工程师",
        "star": 4.7,
        "src": "/pages/images/jobs/软件测试工程师.jpg",
        "introduction1": "上市公司",
        "introduction2": "计算机软件",
        "distance": "4.1km",
        "salary1": "8k",
        "salary2": "1.5k",
        "content1": "统招本科及以上学历，计算机相关专业",
        "content2": "2年及以上实际测试相关从业经验，自动化测试、功能测试均可",
        "content3": "团队意识强烈",
        "comment1": "没压力，同事间勾心斗角的基本没有，工资不高。",
        "comment2": " ....0.0.......................",
        "comment3": " ....0.0.......................",
        "merchants": "重庆卓睿信息技术有限公司是一家专注于金融和电信行业软硬件研发的科技公司，为中高端企业提供软硬件技术生产服务。是中部地区领先的服务外包供应商，我们面向欧美、日本及国内市场的制造业、金融、电信、能源、IT及政府和公共服务行业提供ITO、BPO服务 。重庆卓睿信息技术有限公司拥有优秀的软件产品设计和开发团队，专注于研发具有自主核心技术和知识产权的企业级应用软件。同时，我们也为中小型客户提供网络工程设计、施工、维护及技术咨询服务，公司拥有优秀的技术团队，公司的Java、Android、.net等核心技术人员具有10年以上的相关行业的软件开发和设计经验。公司现已与华为、IBM、微软、百度、阿里集团等国际知名品牌有业务合作关系，与西安软件园常年技术项目合作！",
        "time": 49
      }
    ]
    
  
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
  
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
  
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
  
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
  
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
  
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
  
  }
})